# print("a" + "b")                    # 문자열을 + 로 연결하면 붙여서 출력됨
# print("a", "b")                     # 문자열을 , 로 연결하면 , 뒤에 자동으로 1칸 띄어져서 출력됨


# 방법 1
# print("나는 %d살 입니다" % 20)       # "문자열 %d 문자열" % 정수 : 문자열 사이에 정수값(d)을 입력하는 방법
# print("나는 %s을 좋아해요" % "파이썬") # "문자열 %s 문자열" % 문자열 : 문자열 사이에 문자열(s)을 입력하는 방법
# print("애플은 %c로 시작해요" % "A")  # "문자열 %d 문자열" % 캐릭터(한글자) : 문자열 사이에 캐릭터(c)를 입력하는 방법

# %s를 사용하면 정수, 문자열, 캐릭터 모두 다 사용 가능함!!!

print("나는 %s살 입니다" % 20)

print("나는 %s색과 %s색을 좋아해요" % ("빨간", "파란"))



# 방법 2_1
print("나는 {}살입니다".format(20))     # format 괄호안의 값을 중괄호{}에 표시
print("나는 {}살입니다".format("서른"))

print("나는 {}색과 {}색을 좋아해요".format("빨간", "파란")) 
print("나는 {0}색과 {1}색을 좋아해요".format("빨간", "파란"))               # 중괄호 안에 숫자를 넣어서 사용!!!
print("나는 {1}색과 {0}색을 좋아해요".format("빨간", "파란"))



# 방법 2_2 (format 내에 변수 지정)
print("나는 {age}살이며, {color}색을 좋아해요".format(age = 20, color = "빨간"))
print("나는 {color}살이며, {age}색을 좋아해요".format(age = 20, color = "빨간"))
print("나는 {age}살이며, {color}색을 좋아해요".format(color = "빨간", age = 20))



# 방법 3 (Python v3.6 이상에서만 작동) (f 문자열) (추천!!)
age = 20
color = "빨간"
print(f"나는 {age}살이며, {color}색을 좋아해요")    

# print(f"") : print 괄호속에 f"" 라고 표시하면 위에서 지장한 변수값을 문자열 속 중괄호 속에 입력 시 인식 가능