# 빈 자리는 빈 공간으로 두고, 오른쪽 정렬을 하되, 총 10자리 공간을 확보
print("{0: >10}".format(500))                                           # {0: >10} : 10자리 오른쪽 정렬, 빈자리 빈공간

# 양수일 땐 +로 표시, 음수일 땐 -로 표시
print("{0: >+10}".format(500))                                          # {0: >+10} : + 표시 추가로 숫자 +- 표시
print("{0: >+10}".format(-500))

# 왼쪽 정렬, 빈 자리에 _로 채움
print("{0:_<+10}".format(500))                                          # {0:_<+10} : 10자리 왼쪽 정렬, 빈공간 _표시

# 3자리 마다 콤마를 찍어주기
print("{0:,}".format(100000000))                                        # {0:,} : 3자리 마다 , 표시 (ex. 돈 표시 등)

# 3자리 마다 콤마를 찍어주고 +-부호 붙이기
print("{0:+,}".format(100000000))                                       # {0:+,}
print("{0:+,}".format(-100000000))

# 3자리 마다 콤마, 부호 표시, 자리수 확보하기, 빈 공간에 ^ 표시, 왼쪽 정렬, 총 30자리 공간 확보
print("{0:^<+30,}".format(100000000))                                   # {0:^<+30,}

# 소숫점 출력
print("{0:f}".format(5/3))                                              # {0:f}
print("{0:f}".format(0.333333333333333333333))

# 소숫점 특정 자리까지 출력 (반올림으로 특정 자리 표시)
print("{0:.2f}".format(5/3))                                            # {0:.2f}
print("{0:.2f}".format(0.333333333333333333333))